In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./labels.csv')
df

             id gender age_group      race    body_shape
0      00001_00  woman  twenties     white       average
1      06679_00  woman  twenties     white       average
2      00006_00  woman  twenties     white          slim
3      06749_00  woman  twenties     white          slim
4      07212_00  woman  twenties     white          slim
...         ...    ...       ...       ...           ...
13681  12193_00  woman  twenties     white          slim
13682  12690_00  woman  thirties     white     maternity
13683  14152_00  woman  twenties     white          slim
13684  14243_00  woman  thirties     white  full-figured
13685  14381_00    man  thirties  brunette       unknown

[13686 rows x 5 columns]

In [3]:
for col in df.columns:
    print(f'unique values for:{col}')
    print(df[col].unique())
    print('-'*30)

unique values for:id
['00001_00' '06679_00' '00006_00' ... '14152_00' '14243_00' '14381_00']
------------------------------
unique values for:gender
['woman' 'woman.' 'man']
------------------------------
unique values for:age_group
['twenties' 'thirties' 'forties' 'thorties' 'tthirties' 'twnetis'
 'twwenties' 'therties' 'senior' 'unknown']
------------------------------
unique values for:race
['white' 'brunette' 'black' 'asian' 'indian' 'beunette' 'white4'
 'brunettes' 'unknown']
------------------------------
unique values for:body_shape
['average' 'slim' 'maternity' 'full-figured' 'plus-size' 'full-figures'
 'unknown']
------------------------------

In [4]:
corrections = {
    'gender': {
        'woman.': 'woman',
    },
    'age_group': {
        'thorties': 'thirties',
        'tthirties': 'thirties',
        'therties': 'thirties',
        'twnetis': 'twenties',
        'twwenties': 'twenties',
        'thorties': 'thirties'
    },
    'race': {
        'beunette': 'brunette',
        'brunettes': 'brunette',
        'white4': 'white'
    },
    'body_shape': {
        'full-figures': 'full-figured'
    }
}

In [5]:
for col, mapping in corrections.items():
    df[col]=df[col].replace(mapping)

In [6]:
df

             id gender age_group      race    body_shape
0      00001_00  woman  twenties     white       average
1      06679_00  woman  twenties     white       average
2      00006_00  woman  twenties     white          slim
3      06749_00  woman  twenties     white          slim
4      07212_00  woman  twenties     white          slim
...         ...    ...       ...       ...           ...
13681  12193_00  woman  twenties     white          slim
13682  12690_00  woman  thirties     white     maternity
13683  14152_00  woman  twenties     white          slim
13684  14243_00  woman  thirties     white  full-figured
13685  14381_00    man  thirties  brunette       unknown

[13686 rows x 5 columns]

In [7]:
for col in df.columns:
    print(f'unique values for:{col}')
    print(df[col].unique())
    print('-'*30)

unique values for:id
['00001_00' '06679_00' '00006_00' ... '14152_00' '14243_00' '14381_00']
------------------------------
unique values for:gender
['woman' 'man']
------------------------------
unique values for:age_group
['twenties' 'thirties' 'forties' 'senior' 'unknown']
------------------------------
unique values for:race
['white' 'brunette' 'black' 'asian' 'indian' 'unknown']
------------------------------
unique values for:body_shape
['average' 'slim' 'maternity' 'full-figured' 'plus-size' 'unknown']
------------------------------

In [8]:
df[df['age_group']=='unknown']

             id gender age_group     race body_shape
13644  14541_00    man   unknown  unknown    unknown

In [9]:
df[df['race']=='unknown']

             id gender age_group     race body_shape
13644  14541_00    man   unknown  unknown    unknown

In [10]:
df[df['body_shape']=='unknown']

             id gender age_group      race body_shape
13187  05760_00  woman  twenties     asian    unknown
13644  14541_00    man   unknown   unknown    unknown
13685  14381_00    man  thirties  brunette    unknown

In [11]:
df.loc[df['id']=='05760_00', ['race', 'body_shape']] = ['brunette', 'slim']

In [12]:
df[df['id']=='05760_00']

             id gender age_group      race body_shape
13187  05760_00  woman  twenties  brunette       slim

In [13]:
df.shape[0]

13686

In [14]:
df[df.duplicated(keep=False)]

             id gender age_group      race body_shape
6871   01270_00  woman  twenties  brunette       slim
7323   00081_00  woman  thirties     black       slim
7324   00121_00  woman  thirties     black       slim
8918   00930_00  woman  twenties     black       slim
11241  00081_00  woman  thirties     black       slim
11247  00121_00  woman  thirties     black       slim
11346  00930_00  woman  twenties     black       slim
11385  01270_00  woman  twenties  brunette       slim

In [15]:
df = df.drop_duplicates(keep='first')

In [16]:
df.shape[0]

13682

In [17]:
df[df.duplicated(subset=['id'], keep=False)]

             id gender age_group      race body_shape
7036   01212_00  woman  thirties     black       slim
9489   01040_00  woman  twenties     white    average
9576   01229_00  woman  thirties  brunette       slim
11360  01040_00  woman  thirties  brunette  maternity
11372  01212_00  woman  twenties     white       slim
11374  01229_00  woman  twenties  brunette       slim

In [18]:
df = df.drop_duplicates(subset=['id'], keep='first')

In [19]:
df[df.duplicated(subset=['id'], keep=False)]

Empty DataFrame
Columns: [id, gender, age_group, race, body_shape]
Index: []

In [20]:
df.shape[0]

13679

In [21]:
df.to_csv('preprocessed.csv', index=False)

In [22]:
df = pd.read_csv('./preprocessed.csv')

In [23]:
man_df = df[df['gender']=='man']

In [24]:
man_df

             id gender age_group      race body_shape
10825  12258_00    man  thirties     white    average
10826  12367_00    man  thirties     white    average
11245  00120_00    man  thirties     white    average
11249  00153_00    man  twenties     black    average
11308  00669_00    man  thirties     white    average
11708  05752_00    man  thirties     white    average
12989  01795_00    man  twenties     white    average
13021  02515_00    man  thirties     white    average
13023  02545_00    man  thirties  brunette    average
13063  03334_00    man  thirties  brunette    average
13162  05310_00    man  thirties     white    average
13212  06356_00    man  thirties     white    average
13285  07930_00    man  thirties     white    average
13291  08026_00    man  twenties     white    average
13392  10129_00    man  thirties     white    average
13421  10698_00    man  thirties     white    average
13455  11376_00    man  twenties  brunette       slim
13458  11476_00    man  thirties     white    average
13637  14541_00    man   unknown   unknown    unknown
13678  14381_00    man  thirties  brunette    unknown

In [25]:
man_df.shape[0]

20

In [26]:
woman_df = df[df['gender']=='woman']
woman_df

             id gender age_group   race    body_shape
0      00001_00  woman  twenties  white       average
1      06679_00  woman  twenties  white       average
2      00006_00  woman  twenties  white          slim
3      06749_00  woman  twenties  white          slim
4      07212_00  woman  twenties  white          slim
...         ...    ...       ...    ...           ...
13673  12133_00  woman  twenties  white          slim
13674  12193_00  woman  twenties  white          slim
13675  12690_00  woman  thirties  white     maternity
13676  14152_00  woman  twenties  white          slim
13677  14243_00  woman  thirties  white  full-figured

[13659 rows x 5 columns]

In [27]:
woman_df.shape[0]

13659

In [28]:
df = woman_df

In [29]:
df

             id gender age_group   race    body_shape
0      00001_00  woman  twenties  white       average
1      06679_00  woman  twenties  white       average
2      00006_00  woman  twenties  white          slim
3      06749_00  woman  twenties  white          slim
4      07212_00  woman  twenties  white          slim
...         ...    ...       ...    ...           ...
13673  12133_00  woman  twenties  white          slim
13674  12193_00  woman  twenties  white          slim
13675  12690_00  woman  thirties  white     maternity
13676  14152_00  woman  twenties  white          slim
13677  14243_00  woman  thirties  white  full-figured

[13659 rows x 5 columns]

In [30]:
df.to_csv('./preprocess.ipynb', index=False)